NordicPlayground/nrf52-ble-multi-link-multi-role/ble_peripheral_long_range/main.c
    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle[0], BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    ret_code_t             err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    ret_code_t err_code;
    err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    if(err_code == NRF_SUCCESS)
    {
        bsp_board_led_on(ADVERTISING_LED);
    
        m_application_state.app_state = APP_STATE_ADVERTISING;
        display_update();
    }
    else
    {
        APP_ERROR_CHECK(err_code);
    }
}


static void ble_go_to_idle(void)
{
    ret_code_t err_code;
    switch(m_application_state.app_state)
    {
        case APP_STATE_ADVERTISING:
            err_code = sd_ble_gap_adv_stop(m_adv_handle);
            APP_ERROR_CHECK(err_code);
            break;
            
        case APP_STATE_CONNECTED:
            for(int i = 0; i < (m_application_state.phy == APP_PHY_MULTI ? 3 : 1); i++)
            {
                if(m_conn_handle[i] != BLE_CONN_HANDLE_INVALID)
                {
                    err_code = sd_ble_gap_disconnect(m_conn_handle[i], BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                    APP_ERROR_CHECK(err_code);
                }
            }
            break;
            
        case APP_STATE_DISCONNECTED:
            err_code = app_timer_stop(m_restart_advertising_timer_id);
            APP_ERROR_CHECK(err_code);
            break;
    }
    m_application_state.app_state = APP_STATE_IDLE;
    display_update();
}


static void request_phy(uint16_t c_handle, uint8_t phy)
{
    ble_gap_phys_t phy_req;
    phy_req.tx_phys = phy;
    phy_req.rx_phys = phy;
    sd_ble_gap_phy_update(c_handle, &phy_req);
}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t err_code;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("Connected: %i", p_ble_evt->evt.gap_evt.conn_handle);
            bsp_board_led_on(CONNECTED_LED);
            bsp_board_led_off(ADVERTISING_LED);
            m_conn_handle[p_ble_evt->evt.gap_evt.conn_handle] = p_ble_evt->evt.gap_evt.conn_handle;
            
            err_code = sd_ble_gap_rssi_start(m_conn_handle[p_ble_evt->evt.gap_evt.conn_handle], 1, 2);
            APP_ERROR_CHECK(err_code);

            m_lbs_links_active++;

            if(m_application_state.phy == APP_PHY_2M)
            {
                request_phy(0, BLE_GAP_PHY_2MBPS);
            }
            else if(m_application_state.phy == APP_PHY_MULTI)
            {
                m_application_state.trip_phy_connected[p_ble_evt->evt.gap_evt.conn_handle] = true;
                switch(p_ble_evt->evt.gap_evt.conn_handle)
                {
                    case 1:
                        request_phy(1, BLE_GAP_PHY_1MBPS);
                        break;
                    case 2:
                        request_phy(2, BLE_GAP_PHY_2MBPS);
                        break;
                    default:
                        break;
                }
                if(m_lbs_links_active < 3)
                {
                    //advertising_start();
                    // Start advertising "silently", without changing application state from connected
                    err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
                    if(err_code == NRF_SUCCESS)
                    {
                        bsp_board_led_on(ADVERTISING_LED);
                    }
                }
            }
            
            m_application_state.app_state = APP_STATE_CONNECTED;
            display_update();
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected: H-%i, Rsn-%i", p_ble_evt->evt.gap_evt.conn_handle, p_ble_evt->evt.gap_evt.params.disconnected.reason);
            bsp_board_led_off(CONNECTED_LED);
            m_conn_handle[p_ble_evt->evt.gap_evt.conn_handle] = BLE_CONN_HANDLE_INVALID;
            m_application_state.rssi[p_ble_evt->evt.gap_evt.conn_handle] = 0;

            if(m_application_state.phy == APP_PHY_MULTI)
            {
                m_application_state.trip_phy_connected[p_ble_evt->evt.gap_evt.conn_handle] = false;
                if(m_application_state.app_state == APP_STATE_CONNECTED)
                {
                  switch(m_lbs_links_active)
                  {
                      case 3:
                          //advertising_start();
                          // Start advertising "silently", without changing application state from connected
                          err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
                          if(err_code == NRF_SUCCESS)
                          {
                              bsp_board_led_on(ADVERTISING_LED);
                          }
                          break;
                      case 1:
                          m_application_state.app_state = APP_STATE_ADVERTISING;
                          break;
                  }
                }
            }
            else if(m_application_state.app_state == APP_STATE_CONNECTED)
            {
                m_application_state.app_state = APP_STATE_DISCONNECTED;
            
                err_code = app_timer_start(m_restart_advertising_timer_id, APP_TIMER_TICKS(RESTART_ADVERTISING_TIMEOUT_MS), 0);
                APP_ERROR_CHECK(err_code);
            }

            display_update();

