NordicPlayground/nrf52-ble-multi-link-multi-role/ble_peripheral_long_range/main.c
/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {PHY_BUTTON,       false, BUTTON_PULL, button_event_handler},
        {TX_POWER_BUTTON,  false, BUTTON_PULL, button_event_handler},
        {APP_STATE_BUTTON, false, BUTTON_PULL, button_event_handler},
        {LEDBUTTON_BUTTON, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, sizeof(buttons) / sizeof(buttons[0]),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}


static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

static void display_update()
{
    static bool first_update = true;
    if(first_update)
    {
        m_application_state.main_title = "Blinky Long Range";
        app_display_create_main_screen(&m_application_state);
        first_update = false;
    }
    else
    {
       app_display_update_main_screen(&m_application_state);
    }
    app_display_update();
}


/**@brief Function for the Power Manager.
 */
static void power_manage(void)
{
    ret_code_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for application main entry.
 */
int main(void)
{
    ret_code_t err_code;
    
    // Initialize.
    leds_init();
    timers_init();

    log_init();
    buttons_init();
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    gatt_init();
    conn_params_init();

    // Start execution.
    NRF_LOG_INFO("Blinky example started.");
    
    app_display_init(&m_application_state);
    display_update();

    err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);
    
    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}


/**
 * @}
 */
